app/Controllers/Alumnos.php

    public function index($activo = 1)
    {
        $permiso =  $this->detalleRoles->verificaPermisos($this->session->id_rol, 'ProductosCatalogo');  //verifica roles
        if(!$permiso){                                                                                   //verifica roles
            echo 'No tienes permiso';                                                                    //verifica roles
            exit;                                                                                        //verifica roles
        }

        $alumnos = $this->alumnos->where('activo', $activo)->findAll();
---
SELECT *
FROM `alumnos`
WHERE `activo` = 1

    public function indexAbono($activo = 1)
    {
        $permiso =  $this->detalleRoles->verificaPermisos($this->session->id_rol, 'ProductosCatalogo');  //verifica roles
        if(!$permiso){                                                                                   //verifica roles
            echo 'No tienes permiso';                                                                    //verifica roles
            exit;                                                                                        //verifica roles
        }

        $alumnos = $this->alumnos->where('activo', $activo)->findAll();
---
SELECT *
FROM `alumnos`
WHERE `activo` = 1