app/Controllers/Pagos.php

    public function insertar()
    {
        $permiso =  $this->detalleRoles->verificaPermisos($this->session->id_rol, 'ProductosCatalogo');  //verifica roles
        if(!$permiso){                                                                                   //verifica roles
            echo 'No tienes permiso';                                                                    //verifica roles
            exit;                                                                                        //verifica roles
        }
        if ($this->request->getMethod() == "post" && $this->validate($this->reglas)) {
            $this->pagos->save([
                'id_alumno' => $this->request->getPost('idalumno'),
                'forma_pago' => $this->request->getPost('forma_pago'),
                'ano_deuda' => $this->request->getPost('ano_deuda'),
                'folio_boleta' => $this->request->getPost('folio_boleta'),
                'fecha_pago' => $this->request->getPost('fecha_pago'),
                'monto' => $this->request->getPost('monto') * 1000,
                'comentario' => $this->request->getPost('comentario'),
                'razon_pago' => $this->request->getPost('razon_pago'),
                'id_usuario' => $this->session->id_usuario]);
---
INSERT INTO `pagos` (`id_alumno`, `forma_pago`, `ano_deuda`, `folio_boleta`, `fecha_pago`, `monto`, `comentario`, `razon_pago`, `id_usuario`, `fecha_alta`, `fecha_edit`) VALUES ('23749673', 'Debito', '2022', '3282', '2022-06-03', 55000, 'marzo abono abril', 'Pago mensualidad año en curso', '2', '2022-06-09 10:44:01', '2022-06-09 10:44:01')