app/Models/DetalleRolesPermisosModel.php

SELECT *
FROM `detalle_roles_permisos`
JOIN `permisos` ON `detalle_roles_permisos`.`id_permiso`=`permisos`.`id`
WHERE `id_rol` = '1'
AND `permisos`.`nombre` = 'ProductosCatalogo'
 LIMIT 1
---
    public function verificaPermisos($idRol, $permiso)
    {
        $tieneAcceso = false;
        $this->select('*');
        $this->join('permisos', 'detalle_roles_permisos.id_permiso=permisos.id');
        $existe = $this->where(['id_rol' => $idRol, 'permisos.nombre' => $permiso])->first();