app/Models/PagosModel.php

    public function obtenerTotalPagadoMensualidad($activo=1)
    {

        $this->select("sum(monto) AS monto");
        $where = "pagos.activo = 1 AND pagos.razon_pago = 'Pago mensualidad año en curso' ";
       // $where = "activo = 1 AND monto > 5";
        return $this->where($where)->first();
---
SELECT sum(monto) AS monto
FROM `pagos`
WHERE `pagos`.`activo` = 1 AND `pagos`.`razon_pago` = 'Pago mensualidad año en curso'
 LIMIT 1

    public function totalMes($fecha)
    {

        $this->select("sum(monto) AS monto");
        $fechaUno = date('y-m-01');
       $where = "activo = 1 AND DATE(fecha_alta) >= '$fechaUno' AND DATE(fecha_alta) <= '$fecha'";

        return $this->where($where)->first();
---
SELECT sum(monto) AS monto
FROM `pagos`
WHERE `activo` = 1
 LIMIT 1

    public function totalDia($fecha)
    {

        $this->select("sum(monto) AS montoDia");
       $where = "activo = 1 AND DATE(fecha_alta) = '$fecha'";

        return $this->where($where)->first();
---
SELECT sum(monto) AS monto
FROM `pagos`
WHERE `activo` = 1 AND DATE(fecha_alta) >= '22-06-01' AND DATE(fecha_alta) <= '22-06-09'
 LIMIT 1

    public function totalPagosXalumno($idAlumno)
    {

        $this->select("sum(monto) AS monto");
        $where = "activo = 1 AND id_alumno = '$idAlumno'";
       // $where = "activo = 1 AND monto > 5";
        return $this->where($where)->first();
---
SELECT sum(monto) AS montoDia
FROM `pagos`
WHERE `activo` = 1 AND DATE(fecha_alta) = '22-06-09'
 LIMIT 1