app/Models/VentasModel.php

SELECT sum(total) AS total
FROM `ventas`
WHERE `activo` = 1 AND DATE(fecha_alta) = '22-06-09'
 LIMIT 1
---
    public function totalDia($fecha)
    {

        $this->select("sum(total) AS total");
       $where = "activo = 1 AND DATE(fecha_alta) = '$fecha'";

        return $this->where($where)->first();